
package com.example.android.fragments;

public class Handler {

    static String[] Headlines = {
            "Audi",
            "BMW",
            "Cadillac",
            "Dodge",
            "Fiat",
            "Chrysler",
            "Honda"
    };

    static String[] Articles = {
            "Audi\n\nПод маркой Audi выпускаются автомобили бизнес- и премиум-классов, спорткары, кроссоверы и другие модели, которые отличаются высочайшим качеством и современным дизайном. Компания, возглавляемая Мартином Винтеркорном, была создана в 1909 году, а в настоящее время входит в состав концерна Volkswagen Group.",
            "BMW\n\nBMW — одна из крупнейших немецких компаний, выпускающая в настоящее время мотоциклы, автомобили и велосипеды, — была образована на базе завода авиационных двигателей, основанного в 1913 году в Мюнхене. В 1929 году дебютная машина этой марки, малолитражка Dixi, сошла с конвейера купленного годом раннее завода в Айзенахе. Через 30 лет будет выпущен BMW 700 — первый серийный автомобиль, принесший компании большой успех. В 1994 году в состав Bayerische Motoren Werke AG входит британская промышленная группа Rover, в 1998-м — марка Rolls-Royce. Сегодня концерн располагает пятью современными производственными площадками в Германии и еще 22 дочерними предприятиями по всему миру, а автомобили «БМВ» стали синонимом безупречного дизайна и качества.",
            "Cadillac\n\nCadillac (Кадиллак) — классический американский бренд. Фирма основана в 1902 году инженером Генри Лиландом, названа в честь основателя города Детройта, где находились будущие заводы компании.",
            "Dodge\n\nDodge (Додж) — американский автомобильный бренд, основан братьями Джоном и Горацием Доджами в 1914 году. Под брендом Додж выпускаются внедорожники, легковые автомобили, пикапы и минивэны. Визитная карточка компании — внедорожники, самый популярный из семейства — пикап Dodge Dakota. В 1984 вышла модель переднеприводного минивэна Dodge Caravan (в Европу поставлялся как Chrysler Voyager). Dodge Intrepid — единственная модель Доджа класса «люкс». А в 1989 году Додж представил спортивное купе Viper.",
            "FIAT\n\nFIAT (Фиат) — итальянский автомобильный концерн, основан в 1898 году. Его продукция выпускается как под своим именем, так и под марками ранее знаменитых самостоятельных фирм, таких как «Лянча», «Альфа Ромео», «Феррари», «Мазерати» и «Ивеко». Основные производственные площади Фиата находятся в Турине в Северной Италии, всего же подразделения FiatAuto работают в 190 странах мира.",
            "Chrysler\n\nChrysler (Крайслер) — американский автомобильный концерн. Основан в 1925 году Уолтером Крайслером, ранее работавшим вице-президентом General Motors. В 1998 году произошло слияние с компанией Daimler-Benz, однако в 2007 году компании разошлись. В 2009 году Chrysler заключает альянс с компанией Fiat. Chrysler в 1988 году первым из автопроизводителей сделал подушки безопасности стандартным оборудованием всех своих автомобилей.",
            "Honda\n\nHonda (Хонда) — японская компания, выпускающая легковые автомобили и мотоциклы. Основана в 1946 инженером Соичиро Хонда, первоначально производила двигатели и мопеды. С 1948 года выпускает легендарные мотоциклы, которые сегодня являются самой продаваемой маркой мотоциклов в мире.\n" +
                    "\n" +
                    "В 1962 году Хонда начала производство автомобилей. Мирового признания фирма добилась с моделью Civic. В 1976 году вышла Honda Accord, множество раз становившейся «Автомобилем года», в 1995 — Honda CR-V, в 1994 — минивэн Odyssey, в 1995 — универсал Honda CR-V.",

    };
}
